<template>
  <nb-container>
    <status-bar :barStyle="'light-content'"></status-bar>
    <image-background :source="launchScreenBg" class="imageContainer">
      <nb-grid>
        <nb-row :size="1">
          <view class="text-container">
            <nb-h3 class="text-color-white-header">
              Личный кабинет МФТИ
            </nb-h3>
          </view>
        </nb-row>
        <nb-row :size="10">
          <scroll-view :content-container-style="{contentContainer: {paddingVertical: 20}}">
            <card
                :key="index"
                :cardItem="cardItem"
                v-for="(cardItem, index) in newsArray">
            </card>
          </scroll-view>
        </nb-row>
      </nb-grid>
    </image-background>
  </nb-container>
</template>

<script>
import { Dimensions, Platform } from "react-native";
import launchScreenBg from "../../../assets/launchscreen-bg.png";
import launchscreenLogo from "../../../assets/logo-kitchen-sink.png";
import card from './card';

export default {
  components: {
    card,
  },
  props: {
    navigation: {
      type: Object
    }
  },
  computed: {
    newsArray() {
      return [{"data":"28.02.2020","label":"Неделя финансовой грамотности в МФТИ","img":"https://mipt.ru/upload/iblock/169/frame_2.png","desc":"Со 2 по 5 марта на Физтехе пройдет неделя финансовой грамотности. О том, зачем нужны вклады, какие существуют меры противодействия мошенничеству и где лучше всего хранить деньги, расскажут представители «Сбербанка», «ВТБ», банка «Авангард» и «Газпромбанка»","countViews":"29"},{"data":"27.02.2020","label":"Диспансеризация и профилактический осмотр в 2020 году","img":"https://mipt.ru/upload/iblock/e7d/blue_and_silver_stetoscope_40568.jpg","desc":"Приглашаем студентов\nФизтеха, прикрепленных к поликлинике ГБУЗ МО ДЦГБ, пройти\nежегодный профилактический осмотр и диспансеризацию","countViews":"33"},{"data":"29.01.2020","label":"Факультативный курс «Практические методы возрастной психологии» для студентов Физтеха","img":"https://mipt.ru/upload/iblock/05c/i_03770.jpg","desc":"11 февраля с 16:50 до 18:20 в Московском корпусе МФТИ пройдет первое занятие факультативного курса «Практические методы возрастной психологии» для тех, кто планирует совмещать научную работу с преподавательской и работать с подростками или взрослыми в качестве педагога.","countViews":"172"},{"data":"27.01.2020","label":"Программа медицинского обслуживания для иностранных обучающихся «Доктор рядом»","img":"https://mipt.ru/upload/iblock/6b3/2500_105.jpg","desc":"С 1 февраля 2020 года иностранные студенты МФТИ смогут получить бесплатный квалифицированный врачебный осмотр в рамках реализации программы «Доктор рядом».","countViews":"112"},{"data":"22.01.2020","label":"Открыт набор заявок на получение полисов добровольного медицинского страхования ","img":"https://mipt.ru/upload/iblock/41f/2017.10.05_1020.jpg","desc":"Профсоюзная организация МФТИ начинает принимать заявки на получение полисов ДМС по льготной стоимости.","countViews":"225"},{"data":"25.12.2019","label":"Конкурс вопросов по выбору от кафедры общей физики","img":"https://mipt.ru/upload/iblock/ee6/2018.07.11_1_8960.jpg","desc":"\n\t Кафедра общей физики объявляет конкурс вопросов по выбору, по результатам которого десять студентов выиграют поездку на международную конференцию ICPS 2020 в Мексику, а 50 получат денежное вознаграждение.\n","countViews":"425"},{"data":"23.12.2019","label":"Корпоративная лицензия MATLAB 2019","img":"https://mipt.ru/upload/iblock/1ab/matlab_1_4x.png","desc":"Сотрудникам, преподавателям и студентам стала доступна неограниченная бесплатная лицензияMATLAB","countViews":"385"},{"data":"18.12.2019","label":"График работы врача-терапевта медицинского центра МФТИ","img":"https://mipt.ru/upload/iblock/79b/2500_100.jpg","desc":"\n\t На протяжении всех праздничных дней ежедневно с 1 по 8 января с 15.00 до 18.00 будет организован приём всех заболевших (независимо от прикрепления) врачом-терапевтом медицинского центра МФТИ в кабинете № 33 по адресу ул. Московское шоссе, 23, корпус 5, 1 этаж.\n","countViews":"173"},{"data":"06.12.2019","label":"Отчетность по проектам РНФ","img":"https://mipt.ru/upload/iblock/c1e/18b_rusnf.jpg","desc":"Физтех организует централизованную доставку отчетов РНФ в фонд","countViews":"116"},{"data":"04.12.2019","label":"Опрос о качестве работы техподдержки УИТ","img":"https://mipt.ru/upload/iblock/e35/374b2363_auditor_a_web.jpg","desc":"\n\t До 27 декабря проводится опрос о качестве работы техподдержки управления информационных технологий. Участники могут оценить качество выполненных работ, а также оставить свой комментарий и пожелания сотрудникам управления.\n\n\n \n","countViews":"71"},{"data":"15.11.2019","label":"Собрание аспирантов III - IV курсов","img":"https://mipt.ru/upload/iblock/843/i_03770.jpg","desc":"30 ноября в 10:45 в аудитории 123 ГК состоится собрание аспирантов III - IV курсов.\n Будут рассмотрены вопросы: проведение промежуточной аттестации, проведение государственной итоговой аттестации и защита кандидатских диссертаций.","countViews":"134"},{"data":"15.11.2019","label":"Собрание аспирантов III - IV курсов","img":"https://mipt.ru/upload/iblock/843/i_03770.jpg","desc":"30 ноября в 10:45 в аудитории 123 ГК состоится собрание аспирантов III - IV курсов.\n Будут рассмотрены вопросы: проведение промежуточной аттестации, проведение государственной итоговой аттестации и защита кандидатских диссертаций.","countViews":"134"},{"data":"08.10.2019","label":"В личном кабинете МФТИ теперь можно посмотреть начисления по зарплате, стипендии и матпомощи","img":"https://mipt.ru/upload/iblock/8be/2018.11.06_1_3522.jpg","desc":"В разделе «Мои финансы» в личном кабинете сайта МФТИ запущен новый сервис — Расчетный листок.С его помощью студенты и сотрудники смогут посмотреть начисления по различнымвыплатам без личного обращения в расчетный отдел.","countViews":"835"},{"data":"08.10.2019","label":"Студенты и аспиранты МФТИ смогут попасть на прием терапевта без прикрепления к поликлинике и полиса","img":"https://mipt.ru/upload/iblock/2e9/ulk_10016.jpg","desc":"С 1 октября возобновил работу Медицинский центр МФТИ, находящийся в кабинете №33 поликлиники №2 в Долгопрудном.","countViews":"223"},{"data":"30.09.2019","label":"На Физтехе проходят мероприятия для сотрудников внутренних служб института","img":"https://mipt.ru/upload/iblock/c5b/2019_09_27_3_03508.jpg","desc":"27 и 30 сентябряпрошли инструктажи для сотрудников МФТИ, посвященные применениюпрофессиональных стандартов и системеоплаты труда работников в институте и работеинвентаризационных комиссий.\n ","countViews":"136"},{"data":"28.09.2019","label":"Центр компетенций НТИ МФТИ рассказал о подготовке инженерно-технических кадров в сфере ИТ","img":"https://mipt.ru/upload/iblock/992/1_20014.jpg","desc":"С 27 по 28 сентября в Твери проходил форум о цифровой трансформации Digital Days, на котором на примере ЦК НТИ МФТИбыли представлены подходы к подготовке инженерно-технических кадров в сфере ИТ.","countViews":"31"},{"data":"15.08.2019","label":"Собрание аспирантов первого курса МФТИ ","img":"https://mipt.ru/upload/iblock/773/2019_01_28_2_00000871.jpg","desc":"31 августа в 11:00в239 НКпройдет собрание аспирантов первого курса МФТИ, на котором представители департаментов и кафедр расскажут об организации учебного процесса в аспирантуре.","countViews":"394"},{"data":"30.07.2019","label":"Ученые из МФТИ провели лекции и практику по нейротехнологиям на образовательном интенсиве «Остров 10-22»","img":"https://mipt.ru/upload/iblock/307/66799335_865673710492336_2825371612071591936_o.jpg","desc":"\n\t С 10 по 22 июля в Сколтехе прошел образовательный интенсив«Остров 10-22», организованный в рамках проекта«Университет НТИ 20.35». В его работе приняли участие представители открытой лаборатории ЦК НТИ МФТИ и образовательного проекта лаборатории прикладных кибернетических систем МФТИ —BiTronics Lab.\n","countViews":"184"},{"data":"23.07.2019","label":"Базовая организация МФТИ Институт физики высоких энергий объявила дополнительный набор в аспирантуру","img":"https://mipt.ru/upload/iblock/f02/2017.04.27_28_1_50016.jpg","desc":"\n\t Институт физики высоких энергий (ИФВЭ) Национального исследовательского центра «Курчатовский институт» — базовая организация МФТИ, открывает дополнительный набор учащихся васпирантуру.\n","countViews":"151"},{"data":"16.07.2019","label":"Идет прием заявок на международный конкурс проектов ассоциации «Глобальная энергия»","img":"https://mipt.ru/upload/iblock/d68/b860ef87be268923822f9295257c4e5e.jpg","desc":"\n\t До 31июля идет прием заявок на международную молодежную программу «Глобальная энергия», победители которой получат гранты на продолжение исследований и личные премии в размере одного миллиона рублей.\n","countViews":"106"},{"data":"16.07.2019","label":"Базовая кафедра РКЦ набирает студентов в магистратуру и аспирантуру","img":"https://mipt.ru/upload/iblock/470/logo_rkts-_3_.png","desc":"Идет набор в магистратуру и аспирантуру базовой кафедры Российского квантового центра в рамках Физтех-школы физики и исследований имени Ландау.","countViews":"172"}];
    },
  },
  data() {
    return {
      launchScreenBg,
      launchscreenLogo,
      stylesObj: {
        logoContainerStyle: {
          marginTop: Dimensions.get("window").height / 8
        },
        logoStyle: {
          left: Platform.OS === "android" ? 40 : 50,
          top: Platform.OS === "android" ? 35 : 60
        },
        btnContainer: {
          backgroundColor: "#6faf98",
          alignSelf: "center"
        }
      }
    };
  },
  methods: {
    handleLetGoBtnPress() {
      this.navigation.openDrawer();
    }
  }
};
</script>

<style>
.imageContainer {
  flex: 1;
}
.text-color-primary {
  color: blue;
  font-family: Roboto;
}
.logoContainer {
  flex: 1;
  margin-bottom: 30;
}
.logo {
  position: absolute;
  width: 280;
  height: 100;
}
.text-container {
  align-items: center;
  margin-bottom: 50px;
  width: 100%;
  background-color: transparent;
  position: relative;
}
.text-color-white-header {
  margin-top: 15px;
  width: 100%;
  color: white;
  text-align: center;
}
.button-container {
  background-color: #6faf98;
  align-self: center;
}
</style>
